# Библиотека Pandas

In [1]:
import pandas as pd

In [12]:
frame = pd.read_csv('data_sample_example.tsv', sep='\t', header=0)

In [13]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [14]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [15]:
#изменение типа столбца с помощью функции apply
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [7]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [16]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [17]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 264.0+ bytes

In [18]:
frame.fillna('разнаробочий', inplace=True)

In [19]:
frame

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнаробочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнаробочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [20]:
frame.Position

0    разнаробочий
1         инженер
2        менеджер
3    разнаробочий
4         инженер
5          стажер
Name: Position, dtype: object

In [22]:
frame[['Position']]

       Position
0  разнаробочий
1       инженер
2      менеджер
3  разнаробочий
4       инженер
5        стажер

In [23]:
frame[['Position', 'Name']]

       Position             Name
0  разнаробочий      Иванов А.А.
1       инженер     Сорокин И.В.
2      менеджер       Белов М.М.
3  разнаробочий  Мельникова Д.С.
4       инженер      Рыбина Е.П.
5        стажер     Костров С.О.

In [24]:
frame.head(3)

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  разнаробочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [27]:
#Обращение по индексу
frame[:3]

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  разнаробочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [28]:
frame[:5:2]

          Name      Birth    City      Position
0  Иванов А.А. 1980-03-22  Москва  разнаробочий
2   Белов М.М. 1980-02-13  Ростов      менеджер
4  Рыбина Е.П. 1985-11-19  Москва       инженер

In [29]:
frame[-3:]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнаробочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [30]:
frame.loc[[1,3,5],['Name','City']]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [32]:
frame.iloc[[1, 3, 5], [0, 2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [33]:
frame.ix[[1,3,5],['Name','City']]

C:\Users\GLFS\Anaconda3\envs\py27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [35]:
frame.ix[[1, 3, 5], [0, 2]]

C:\Users\GLFS\Anaconda3\envs\py27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [36]:
#выбираем строки, которые удовлетворяют условию frame.Birth >= pd.datetime(1985,1,1)
frame[frame.Birth >= pd.datetime(1985,1,1)]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнаробочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [38]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) & (frame.City != 'Москва') ]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнаробочий

In [39]:
True & True

True

In [40]:
True and True

True

In [41]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) | 
      (frame.City == 'Волгоград')]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
3  Мельникова Д.С. 1985-04-15     Ростов  разнаробочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [44]:
frame.size

24